RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/CMSIS/GD/GD32H7xx/Source/IAR/startup_gd32h7xx.s
        PUBWEAK MDIO_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDIO_IRQHandler
        B MDIO_IRQHandler

        PUBWEAK MDMA_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDMA_IRQHandler
        B MDMA_IRQHandler

        PUBWEAK SDIO1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SDIO1_IRQHandler
        B SDIO1_IRQHandler

        PUBWEAK HWSEM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HWSEM_IRQHandler
        B HWSEM_IRQHandler

        PUBWEAK ADC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC2_IRQHandler
        B ADC2_IRQHandler

        PUBWEAK CMP0_1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP0_1_IRQHandler
        B CMP0_1_IRQHandler

        PUBWEAK CTC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CTC_IRQHandler
        B CTC_IRQHandler

        PUBWEAK RAMECCMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RAMECCMU_IRQHandler
        B RAMECCMU_IRQHandler

        PUBWEAK OSPI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
OSPI1_IRQHandler
        B OSPI1_IRQHandler

        PUBWEAK RTDEC0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RTDEC0_IRQHandler
        B RTDEC0_IRQHandler

        PUBWEAK RTDEC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RTDEC1_IRQHandler
        B RTDEC1_IRQHandler

        PUBWEAK FAC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FAC_IRQHandler
        B FAC_IRQHandler

        PUBWEAK TMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TMU_IRQHandler
        B TMU_IRQHandler

        PUBWEAK TIMER22_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER22_IRQHandler
        B TIMER22_IRQHandler

        PUBWEAK TIMER23_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER23_IRQHandler
        B TIMER23_IRQHandler

        PUBWEAK TIMER30_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER30_IRQHandler
        B TIMER30_IRQHandler

        PUBWEAK TIMER31_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER31_IRQHandler
        B TIMER31_IRQHandler

        PUBWEAK TIMER40_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER40_IRQHandler
        B TIMER40_IRQHandler

        PUBWEAK TIMER41_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER41_IRQHandler
        B TIMER41_IRQHandler

        PUBWEAK TIMER42_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER42_IRQHandler
        B TIMER42_IRQHandler

        PUBWEAK TIMER43_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER43_IRQHandler
        B TIMER43_IRQHandler

        PUBWEAK TIMER44_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER44_IRQHandler
        B TIMER44_IRQHandler

        PUBWEAK TIMER50_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER50_IRQHandler
        B TIMER50_IRQHandler

        PUBWEAK TIMER51_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER51_IRQHandler
        B TIMER51_IRQHandler

        PUBWEAK USBHS1_EP1_OUT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USBHS1_EP1_OUT_IRQHandler
        B USBHS1_EP1_OUT_IRQHandler

        PUBWEAK USBHS1_EP1_IN_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USBHS1_EP1_IN_IRQHandler
        B USBHS1_EP1_IN_IRQHandler

        PUBWEAK USBHS1_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USBHS1_WKUP_IRQHandler
        B USBHS1_WKUP_IRQHandler

        PUBWEAK USBHS1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USBHS1_IRQHandler
        B USBHS1_IRQHandler

        PUBWEAK ENET1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ENET1_IRQHandler
        B ENET1_IRQHandler

        PUBWEAK ENET1_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ENET1_WKUP_IRQHandler
        B ENET1_WKUP_IRQHandler

        PUBWEAK CAN0_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_WKUP_IRQHandler
        B CAN0_WKUP_IRQHandler

        PUBWEAK CAN0_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_Message_IRQHandler
        B CAN0_Message_IRQHandler

        PUBWEAK CAN0_Busoff_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_Busoff_IRQHandler
        B CAN0_Busoff_IRQHandler

        PUBWEAK CAN0_Error_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_Error_IRQHandler
        B CAN0_Error_IRQHandler

        PUBWEAK CAN0_FastError_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_FastError_IRQHandler
        B CAN0_FastError_IRQHandler

        PUBWEAK CAN0_TEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_TEC_IRQHandler
        B CAN0_TEC_IRQHandler

        PUBWEAK CAN0_REC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_REC_IRQHandler
        B CAN0_REC_IRQHandler

        PUBWEAK CAN1_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_WKUP_IRQHandler
        B CAN1_WKUP_IRQHandler

        PUBWEAK CAN1_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_Message_IRQHandler
        B CAN1_Message_IRQHandler

        PUBWEAK CAN1_Busoff_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_Busoff_IRQHandler
        B CAN1_Busoff_IRQHandler

        PUBWEAK CAN1_Error_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_Error_IRQHandler
        B CAN1_Error_IRQHandler

        PUBWEAK CAN1_FastError_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_FastError_IRQHandler
        B CAN1_FastError_IRQHandler

        PUBWEAK CAN1_TEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_TEC_IRQHandler
        B CAN1_TEC_IRQHandler

        PUBWEAK CAN1_REC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_REC_IRQHandler
        B CAN1_REC_IRQHandler

        PUBWEAK CAN2_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_WKUP_IRQHandler
        B CAN2_WKUP_IRQHandler

        PUBWEAK CAN2_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_Message_IRQHandler
        B CAN2_Message_IRQHandler

        PUBWEAK CAN2_Busoff_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_Busoff_IRQHandler
        B CAN2_Busoff_IRQHandler

